zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_sha_v1.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V1_Sha_Start
****************************************************************************//**
*
* Initializes the initial hash vector.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V1_Sha_Start(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if (hashState != NULL)
    {
        hashState->blockIdx = 0U;
        hashState->messageSize = 0U;

        if (hashState->hashSize != 0U)
        {
            Cy_Crypto_Core_V1_MemCpy(base, (void*)hashState->hash, (void const*)hashState->initialHash, (uint16_t)hashState->hashSize);

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V1_Sha_Update
****************************************************************************//**
*
* Performs the SHA calculation on one message.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param message
* The pointer to the message whose Hash is being computed.
*
* \param messageSize
* The size of the message whose Hash is being computed.
*
* \return
* \ref cy_en_crypto_status_t
*
* \note
* This function can be called several times only with message lengths dividable
* by the block size. Only the last call to the function can process a message with
* a not-dividable size.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V1_Sha_Update(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t const *message,
                               uint32_t  messageSize)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if(messageSize == 0UL)
    {
        return CY_CRYPTO_SUCCESS;
    }

    if ((hashState != NULL) && (message != NULL))
    {
        if (hashState->blockSize != 0U)
        {

            hashState->messageSize += messageSize;

            uint32_t hashBlockIdx  = hashState->blockIdx;
            uint32_t hashBlockSize = hashState->blockSize;

            /* Processing the fully filled blocks with remaining buffer data */
            while ((hashBlockIdx + messageSize) >= hashBlockSize)
            {
                uint32_t tempBlockSize = hashBlockSize - hashBlockIdx;

                Cy_Crypto_Core_V1_MemCpy(base, (void *)((uint32_t)hashState->block + hashBlockIdx), (void const*)message, (uint16_t)tempBlockSize);

                Cy_Crypto_Core_V1_Sha_ProcessBlock(base, hashState, hashState->block);

                messageSize -= tempBlockSize;
                message += tempBlockSize;

                hashBlockIdx = 0U;
            }

            /* The remaining block will be calculated in the Finish function. */
            hashState->blockIdx = hashBlockIdx + messageSize;

            /* Copy the end of the message to the block */
            if (messageSize != 0U)
            {
                Cy_Crypto_Core_V1_MemCpy(base, (void *)((uint32_t)hashState->block + hashBlockIdx), (void const*)message, (uint16_t)messageSize);
            }
        

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V1_Sha_Finish
****************************************************************************//**
*
* Completes the SHA calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param digest
* The pointer to the calculated hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V1_Sha_Finish(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t *digest)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if ((hashState != NULL) && (digest != NULL))
    {
        uint8_t *hashPtr = hashState->hash;
        uint8_t *blockPtr = hashState->block;
        uint32_t hashBlockSize = hashState->blockSize;
        uint32_t hashBlockIdx = hashState->blockIdx;
        uint64_t finalMessageSizeInBits = (uint64_t)hashState->messageSize * 8U;
        uint32_t padSize;

        if (CY_CRYPTO_SHA512_BLOCK_SIZE == hashBlockSize)
        {
            padSize = CY_CRYPTO_SHA512_PAD_SIZE; /* Pad size = 112 */
        }
        else
        {
            padSize = CY_CRYPTO_SHA256_PAD_SIZE; /* Pad size = 56 */
        }

        /* Append 1 bit to the end of the message */
        blockPtr[hashBlockIdx] = 0x80U;

        /* Clear the rest of the block */
        Cy_Crypto_Core_V1_MemSet(base, (void* )&blockPtr[hashBlockIdx + 1U], 0x00U, (uint16_t)(hashBlockSize - hashBlockIdx - 1U));

        if (hashBlockIdx >= padSize)
        {
            /* Here we need one additional last block to calculate SHA, prepare it: */
            Cy_Crypto_Core_V1_Sha_ProcessBlock(base, hashState, (uint8_t*)blockPtr);

            /* Clear the last block */
            Cy_Crypto_Core_V1_MemSet(base, (void*)blockPtr, 0x00u, (uint16_t)hashBlockSize);
        }

        blockPtr[hashBlockSize - 8U] = (uint8_t)((finalMessageSizeInBits) >> 56U);
        blockPtr[hashBlockSize - 7U] = (uint8_t)((finalMessageSizeInBits) >> 48U);
        blockPtr[hashBlockSize - 6U] = (uint8_t)((finalMessageSizeInBits) >> 40U);
        blockPtr[hashBlockSize - 5U] = (uint8_t)((finalMessageSizeInBits) >> 32U);
        blockPtr[hashBlockSize - 4U] = (uint8_t)((finalMessageSizeInBits) >> 24U);
        blockPtr[hashBlockSize - 3U] = (uint8_t)((finalMessageSizeInBits) >> 16U);
        blockPtr[hashBlockSize - 2U] = (uint8_t)((finalMessageSizeInBits) >> 8U);
        blockPtr[hashBlockSize - 1U] = (uint8_t)(finalMessageSizeInBits);

        /* Process the last block */
        Cy_Crypto_Core_V1_Sha_ProcessBlock(base, hashState, (uint8_t*)blockPtr);

        /* Invert endians of the hash and copy it to digest, re-use the padSize variable */
        padSize = (uint32_t)(hashState->digestSize / 4U);

        for(; padSize != 0U; padSize--)
        {
            *(digest)   = *(hashPtr+3);
            *(digest+1) = *(hashPtr+2);
            *(digest+2) = *(hashPtr+1);
            *(digest+3) = *(hashPtr);

            digest  += 4U;
            hashPtr += 4U;
        }

        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return (tmpResult);
}

